const test = [
    {
        testName: "Setgel gutral",
        question: [
            "Би ерөнхийдөө амьдралаас эерэг мэдрэмж авч чаддаггүй юм шиг санагддаг.",
            "Би аливаа зүйлсэд санаачлагагүй хандаж, ямар нэгэн зүйл хийх сонирхолгүй болсон.",
            "Надад хүсэл тэмүүлэл юу ч байхгүй болсон мэт мэдрэгдэж байсан.",
            "Надад гунигтай, сэтгэлээр унасан мэдрэмжүүд төрж байсан.",
            "Би ямар нэгэн зүйлээс урам зориг авахаа больсон.",
            "Би тийм ч үнэ цэнтэй хүн биш юм шиг санагдах болсон.",
            "Амьдрал утгагүй мэт санагдаж байсан."
        ],
        result: [
            {
                result:"Надад тохиолдоогүй",
                score:0
            },
            {
                result:"Надад заримдаа тохиолдсон",
                score:1
            },
            {
                result:"Надад тодорхой хугацаанд тохиолдож байсан",
                score:2
            },
            {
                result:"Надад маш олон тохиолдсон",
                score:3
            }
        ],
    },
    {
        testName: "Stress",
        question: [
            "Сүүлийн үед надад амьсгал аваад гаргахад хүндрэлтэй санагддаг болсон.",
            "Миний аливаа нөхцөл байдалд үзүүлж байгаа хариу үйлдэл маань хэтэрхий их болсон.",
            "Би аливаа зүйлийг маш их энерги зарцуулж хийдэг.",
            "Нэлээд амархан цухалдаж уурладаг болсон.",
            "Хааяа тайвшрахад хэцүү байдаг.",
            "Би ямар нэгэн зүйл хийж байхад саад болсон зүйлд тэвчилгүй уцаарлах байсан.",
            "Би түргэн ууртай болсон."
        ],
        result: [
            {
                result:"Надад тохиолдоогүй",
                score:0
            },
            {
                result:"Надад заримдаа тохиолдсон",
                score:1
            },
            {
                result:"Надад тодорхой хугацаанд тохиолдож байсан",
                score:2
            },
            {
                result:"Надад маш олон тохиолдсон",
                score:3
            }
        ],
    },
    {
        testName: "UII",
        question: [
            "Миний гадаад төрх надад таалагддаг",
            "Би аливаа зүйлийг хийхээсээ өмнө сайн боддог",
            "Би үе тэнгийнхний дарамт шахалтыг ихэвчлэн эсэргүйцдэг",
            "Би өөртөө итгэлтэй байдаг",
            "Би бусад хүмүүст таалагдахын тулд хуурамч дүр хэзээ ч эсгэдэггүй",
            "Би зөв зүйлийг л хийхийг хичээдэг",
            "Би шийдвэр гаргаад түүнийгээ тууштай баримталж чаддаг",
            "Би тийм ч амар бууж өгдөггүй",
            "Би зөв гэж бодсон зүйлээ хамгаалан босдог",
            "Биеийнхээ гадаад үзэмжээрээ би бахархдаг",
            "Би өөрөө өөртөө таалагддаг",
            "Бусадтай хэл амаа ололцоход надад хялбар байдаг",
            "Эсрэг хүйсний хүмүүстэй найз нөхөд болоход надад хүндрэл гардаггүй"
        ],
        result: [
            {
               result: "Санал бүрэн нийлж байна",
               score: 5
            },
            {
                result: "Санал ерөнхийдөө нийлж байна",
                score:4
            },
            {
                result:"Эргэлзэж байна",
                score:3
            },
            {
                result:"Санал ерөнхийдөө нийлэхгүй байна",
                result:2
            },
            {
                result:"Санал огт нийлэхгүй байна",
                score:1
            }
        ],
    },
    {
        testName: "Tugshuur",
        question: [
            "Ам хатдаг болсон.",
            "Амьсгалахад хүндрэлтэй байх болсон (Ялангуяа хэт их амьсгалах, биеийн ачаалал аваагүй байхад амьсгаадах)",
            "Үе үе гар чичрэх тохиолдлууд надад гарсан.",
            "Би хэтэрхий их сандарснаасаа болоод өөрийгөө эвгүй байдалд оруулах үйлдэл хийж байсан.",
            "Заримдаа юунаас болсноо мэдэхгүй ч сандрах мэдрэмж төрөөд байдаг.",
            "Биеийн хүчтэй ачаалал аваагүй байхад зүрх дэлсэхийг мэдэрч байсан.",
            "Ямар нэгэн тодорхой шалтгаангүйгээр айдсыг мэдэрч байсан."
        ],
        result: [
            {
                result:"Надад тохиолдоогүй",
                score:0
            },
            {
                result:"Надад заримдаа тохиолдсон",
                score:1
            },
            {
                result:"Надад тодорхой хугацаанд тохиолдож байсан",
                score:2
            },
            {
                result:"Надад маш олон тохиолдсон",
                score:3
            }
        ],
    },
    
]

const challenge = [
    {
        category: "Setgel gutral",
        t1: [
            {
                name:"Инээмсэглэлийн цуглуулга 📸",
                daalgavar:"Өдөр бүр инээмсэглэж буй нэг зураг дарах эсвэл өөрийг нь инээлгэсэн үйл явдлыг тэмдэглэх.",
                example: [],
                zorilgo:"🎯 Өөрийгөө аз жаргалтай мөчүүд дээр төвлөрөхөд сургах"
            },
            {
                name:"Хачирхалтай даалгавар🤹‍♂️",
                daalgavar:"Өдөр бүр ердийн бус, хөгжилтэй даалгавар гүйцэтгэх.",
                example: [
                    "Зүүн гараараа зураг зурах.",
                    "Нүдээ аниад нэрсэн ус, ундаа амталж ялгах.",
                    "Хөгжилтэй бүжиг хийх, эсвэл нэг өдөр ганцхан өнгийн хувцас өмсөх."
                ],
                zorilgo:"🎯 Өдөр тутмын хэв маягийг эвдэж бүтээлч сэтгэлгээг хөгжүүлэх."
            },
            {
                name:"Эерэг үгсийн ангууч 🔍",
                daalgavar:"Өдөр бүр ном, кино, эсвэл хүмүүсийн ярианаас 3 эерэг үг олж тэмдэглэх.",
                example: [],
                zorilgo:"🎯 айн сайхан зүйлийг олж харах, анзаарах дадал суулгах."
            },
            {
                name:"Надад ямар супер чадвар байна вэ? 🦸‍♀️",
                daalgavar:"Өөрийнхөө давуу тал, онцлог чадвараа олж тодорхойлох. Хэрэв санаанд орж ирэхгүй бол найз, гэр бүлийнхэнтэйгээ ярилцаж туслалцаа авах.",
                example: [],
                zorilgo:"🎯 Өөртөө итгэх итгэлийг нэмэгдүүлэх, өөрийгөө зөвөөр үнэлэх."
            },
            {
                name:"Хөгжилтэй даалгаврын гинжин холбоо🔗",
                daalgavar:"Найзуудтайгаа хамт гинжин хэлбэрийн тоглоом зохиох.",
                example: [
                    "Нэг нь 'Өнөөдөр би нэг хөгжилтэй үйлдэл хийх болно' гэж хэлнэ.",
                    "Дараагийнх нь 'Би хэн нэгнийг инээлгэх хөгжилтэй үг хэлнэ' гэх мэт үргэлжлүүлнэ."
                ],
                zorilgo:"🎯 Багийн уур амьсгал сайжруулах, хөгжилтэй байдал бий болгох."
            }
        ],
        t2: [
            {
                name:"Сэтгэл санааны өнгө🎨",
                daalgavar:"Өдөр бүр өөрийн сэтгэл санааг өнгөөр илэрхийлэх.",
                example: [
                    "Хэрвээ шар сонговол – аз жаргалтай,",
                    "цэнхэр бол – тайван,",
                    "саарал бол – гунигтай гэх мэт.",
                ],
                zorilgo:"🎯 Өдөр тутмын сонирхолтой байдлыг нэмэгдүүлэх, урам зоригтой байх."
            },
            {
                name:"Баярлуулах нууц даалгавар🎁",
                daalgavar:"Хэн нэгнийг баярлуулах нууц даалгавар гүйцэтгэх.",
                example: [
                    "Гэр бүлийн хүнд туслах,",
                    "Найздаа сайхан үг хэлэх,",
                    " Хэн нэгэнд гэнэтийн жижиг бэлэг өгөх байж болно."
                ],
                zorilgo:"🎯 Эерэг харилцааг дэмжих, бусдад туслах нь өөрийгөө илүү сайхан мэдрэхэд тусалдаг."
            },
            {
                name:"Ямар нэг шинэ зүйл туршъя!🚀",
                daalgavar:"Өдөр бүр өөртөө шинэ туршлага бий болгох.",
                example: [
                    "Шинэ амттай хоол идэх,",
                    "Өөр төрлийн хөгжим сонсох,",
                    "Гэртээ өөр газар унтах гэх мэт."
                ],
                zorilgo:"🎯 Өдөр тутмын сонирхолтой байдлыг нэмэгдүүлэх, урам зоригтой байх."
            },
            {
                name:"Талархлын 3 минут⏳",
                daalgavar:"Өдөр бүр 3 минут зарцуулж, аз жаргалтай эсвэл талархаж буй 3 зүйлээ бодож, тэмдэглэх",
                example: [],
                zorilgo:"🎯 Өөдрөг хандлага төлөвшүүлэх, анхаарлаа эерэг зүйлд төвлөрүүлэх."
            },
            {
                name:"Аз жаргалын жагсаалт📝",
                daalgavar:"Өөрийг нь аз жаргалтай болгодог 10 зүйл-ийн жагсаалт гаргах. Дараа нь эдгээрийн нэгийг өдөр бүр хийхийг оролдох.",
                example: [
                    "✅ Сонирхолтой ном унших",
                    "✅ Дуртай дуугаа сонсох",
                    "✅ Найзтайгаа ярилцах"
                ],
                zorilgo:"🎯 Өөрийгөө аз жаргалтай байлгах үйлдлүүдийг ухамсарлах."
            },
        ],
        t3: [
            {
                name:"Өдөр тутмын эерэг үгс🗣️",
                daalgavar:"Өдөр бүр өөртөө 3 эерэг зүйл хэлэх.",
                example: [
                    "Би чадна!",
                    "Өнөөдөр би сайхан хүн байж чадна!",
                    "Миний хийх зүйл амжилттай болно!",
                    "Эсвэл хүссэн үгсээ тэмдэглэж, өдөр бүр уншиж бай."
                ],
                zorilgo:"🎯 Өөртөө итгэх итгэлийг нэмэгдүүлэх, сэтгэл санааг дэмжих."
            },
            {
                name:"Сэтгэл санааны өвчин намдаах 5 минут🧘‍♀️",
                daalgavar:"Өдөр бүр 5 минутыг тайвшрахад зориулж, биеэ болон сэтгэлээ амраах.",
                example: [
                    "Гүн амьсгал авах,",
                    "Сэдэвчилсэн медитаци хийх,",
                    "Тайван, зөөлөн хөгжим сонсох."
                ],
                zorilgo:"🎯 Стрессийг бууруулах, сэтгэл санааг тогтворжуулах."
            },
            {
                name:"Тууштай байхын чэллэнж💪",
                daalgavar:"Өдөр бүр өөртөө нэг жижиг зорилт тавьж, үүнийг тууштай гүйцэтгэх.",
                example: [
                    "Хоол хийх,",
                    "Өдөр тутмын үүргээ биелүүлэх,",
                    "Шинэ ном унших. Эдгээр зорилго нь өдөр тутамд биелэгдэх боломжтой байх ёстой."
                ],
                zorilgo:"🎯 Тууштай байдал, амжилттай хандлагыг хөгжүүлэх."
            },
            {
                name:"Өдөр бүр нэг баяртай мөч✨",
                daalgavar:"Өдөр бүр нэг зүйл хийж, тэр мөчийг баяртайгаар тэмдэглэх.",
                example: [
                    "Хүүхэлдэйн кино үзэх,",
                    "Дуртай хүнтэйгээ ярих,",
                    "Багцлан бичих,",
                    "Зураг авах. Өдөр бүрийн жижиг баяр нь сэтгэл санааг сайжруулахад тусална."
                ],
                zorilgo:"🎯 Эерэг өдрийг бүрдүүлэх, сэтгэл санааг сайжруулах."
            },
            {
                name:"Өөртөө талархал илэрхийлэх🙏",
                daalgavar:"Өдөр бүр өөртөө талархал илэрхийлэх, өөрийн хийгээд өнгөрүүлсэн сайхан зүйлсээ бичиж тэмдэглэх.",
                example: [
                    "Би энэ өдрийнхаа туршид сайхан үйлдэл хийсэн,",
                    "би өөртөө талархаж байна",
                    "Өнөөдөр би ажлаа амжилттай дуусгалаа, би бахархаж байна!",
                ],
                zorilgo:"🎯 Өөрийгөө үнэлэх, талархал мэдрэх."
            }
        ],
        t4: [
            {
                name:"Өдөр тутмын зорилт болон амжилтын хуудас📋",
                daalgavar:"Өдөр бүр өөртөө 2-3 жижиг зорилт тавиад, тэдгээрийг гүйцэтгэсний дараа амжилтаа тэмдэглэж бичих.",
                example: [
                    "Өглөө эрт босох,",
                    "Өдөр тутмын хичээлээ гүйцэтгэх,",
                    "Дуртай хоббигоо хийх.",
                ],
                zorilgo:"🎯 Өдөр тутмын амжилтыг тэмдэглэх, өөртөө итгэх итгэлийг нэмэгдүүлэх."
            },
            {
                name:"Өдөр тутмын 5 минутын өөрийгөө хайх🧘‍♂️",
                daalgavar:"Өдөр бүр 5 минутыг өөртөө зориулж, тайвшрах, амрах, сэтгэл санаагаа сэргээх.",
                example: [
                    "Гүн амьсгал авах,",
                    "Тайван орчинд сууж бодож сэтгэх,",
                    "Эсвэл хурдан алхалт хийх.",
                ],
                zorilgo:"🎯 Бие, сэтгэл зүйн амрах болон хүч авах дасгал хийх, сэтгэл санааг тэнцвэржүүлэх."
            },
            {
                name:"Өдөр тутмын өөрчлөлт🔄",
                daalgavar:"Өдөр бүр өөрийгөө жижиг өөрчлөлт хийж, шинэ зүйл туршиж үзэх.",
                example: [
                    "Өдөр тутмын хичээлдээ шинэ арга ашиглах,",
                    "Өдөр тутмын зуршлаа шинэчилж, шинэ хобби эхлэх,",
                    "Багахан өөрчлөлт хийх, бүрэн шинэ өдрийг эхлүүлэх.",
                ],
                zorilgo:"🎯 Өдөр тутмын хэвшилтэйгээ тогтмол ажиллах, шинэ туршлага олж авах."
            },
            {
                name:"Надад сайн мэдрэмж төрүүлдэг зүйлс💡",
                daalgavar:"Өдөр бүр өөрт сайн мэдрэмж төрүүлдэг зүйлсийг жагсааж бичих, дараа нь нэг зүйлсийг хийж үзэх.",
                example: [
                    "Дуртай дуугаа сонсох,",
                    "Ямар нэг хоббигоо хийх,",
                    "Хурдан алхалт хийх, байгалийг ажиглах.",
                ],
                zorilgo:"🎯 Өдөр тутамд сэтгэл санааг дээшлүүлэх, амьдралын эерэг зүйлсийг анхаарах."
            },
            {
                name:"Хүчтэй сэтгэл санааны илэрхийлэл✍️",
                daalgavar:"Өдөр бүр сэтгэл зүйн бэрхшээл, хүсэл тэмүүлэл, эсвэл сэтгэл доторх бодлоо бичих. Үүнд өөрийн сэтгэл санааны түвшинг дотроо ойлгох, түүнээс гарч болох шийдлийг хайх.",
                example: [
                    "Сэтгэл гутрал, түгшүүрийг бичиж, түүнийг хэрхэн даван туулах аргаа бичих.",
                    "Сайн сайхныг хүлээж буй зүйлсээ бичиж, урам зориг авах.",
                ],
                zorilgo:"🎯 Сэтгэл зүйн мэдрэмжээ илэрхийлэх, өөрийгөө ойлгох."
            },
            
        ],
        t5: [
            {
                name:"Өдөр тутмын 10 минутын тайвшрал🌿",
                daalgavar:"Өдөр бүр 10 минутыг бие болон сэтгэл зүйгээ амраах дасгалд зориул. Энэ нь гүн амьсгал, тайван орчинд суух, байгалийг ажиглах, эсвэл сонсголын эмчилгээ (аромотерапи) хийх байж болно.",
                example: [],
                zorilgo:"🎯 Стрессийг бууруулах, сэтгэл санааны тэнцвэрийг олох."
            },
            {
                name:"Өөрийн хүчтэй талууд💪",
                daalgavar:"Өдөр бүр өөрийн хамгийн том давууд, хүчтэй талууд-ыг бичиж гаргах.",
                example: [
                    "Тэр дуртай хоббигоо хурдан сурах,",
                    "Тогтвортой байдал, асуудал шийдэх чадвар гэх мэт.",
                    "Эдгээрийг өдөр бүр харж, сэтгэл санаагаа дээшлүүлнэ."
                ],
                zorilgo:"🎯 Өөрийгөө үнэлэх, өөрийн хүчийг мэдрэх."
            },
            {
                name:"Зорилгоо амжилттай гүйцэтгэх✅",
                daalgavar:"Өдөр бүр 1 том зорилго тавьж, өөртөө түүнийг хийж гүйцэтгэх хугацааг тогтоох.",
                example: [
                    "Өдөр тутмын үүрэгт ажил хийх,",
                    "Дуртай хоббигоо хийх,",
                    "Өөрийн доторх сэтгэл зүйн асуудалтай тэмцэх гэх мэт.",
                    "Энэ зорилгыг хийгээд амжилттай гүйцэтгэсний дараа өөртөө шагнал өгөх."
                ],
                zorilgo:"🎯 Сэтгэл санааны тэнцвэрийг олох, өөртөө итгэх итгэлийг нэмэгдүүлэх."
            },
            {
                name:"Талархлын тэмдэглэл📖",
                daalgavar:"Өдөр бүр талархал илэрхийлэх 3 зүйлсийг тэмдэглэж бичих.",
                example: [
                    "Өнөөдөр тохиолдсон эерэг үйл явдал,",
                    "Гэр бүл, найз нөхөд, хамт олон,",
                    "Өөрийнхөө сэтгэл зүйн өсөлт гэх мэт.",
                    "Эдгээрийг өдөр бүр бичиж, сэтгэл зүйн тэнцвэрийг хангах."
                ],
                zorilgo:"🎯 Өөдрөг бодол, сэтгэл санааг сайжруулах."
            },
            {
                name:"Түр зуурын асуудлуудыг шийдэх дасгал💭",
                daalgavar:"Сэтгэл санааны хүндрэл, түгшүүр, стресстэй холбоотой нэг асуудлыг өдөр бүр шийдэх. Энэ нь ямар ч жижиг зүйл байж болно.",
                example: [
                    "Ганцаардалтай тэмцэх,",
                    "Хамгийн их түгшүүртэй сэдвийг бичиж, өөрийн шийдлийг олох.",
                    "Өөрийн сэтгэл санааны бэрхшээлийг бууруулахыг оролдох.",
                ],
                zorilgo:"🎯 Сэтгэл санааны сөрөг хандлагуудыг эрсдэлгүйгээр даван туулах."
            },
        ]
    },
    {
        category: "Tugshuur",
        t1: [
            {
                name:"Амралтын цагийг төлөвлөх",
                daalgavar:"Хүүхдийг амралтын цагийг төлөвлөх, анхаарлаа төвлөрүүлэхээр чиглэсэн сорилт өгч болно.",
                example: [
                    "20 минутын турш юу хийж, амрахаа шийдээд түүнийгээ хийж үзэх.",
                ],
            },
            {
                name:"Мэдрэмжийн дэвтэр хөтлөх",
                daalgavar:"Хүүхдэд өөрийн мэдрэмжээ өдөр бүр тэмдэглэхийг уриалаарай.",
                example: [
                    "'Өнөөдөр би ямар мэдрэмжтэй байсан бэ?' гэсэн асуулт тавьж, түүний мэдрэмжийг илэрхийлж бичихийг зөвлөн, түүнд энэ нь түүний түгшүүрийг бууруулахад тусална.",
                ],
            },
            {
                name:"Өдөр тутмын эерэг үйлдлүүд",
                daalgavar:"Хүүхдийг өдөр бүр эерэг үйлдлүүд хийхийг зөвлөж болно.",
                example: [
                    "'Өнөөдөр нэг удаа найздаа тусалсан уу?' эсвэл 'Өнөөдөр ямар нэг шинэ зүйл сурсан уу?' гэх мэт асуулт тавьж, түүнийг эерэг туршлагаас суралцах боломжтой болгоно.",
                ],
            },
            {
                name:"Мэдрэмжийн тухай ярих",
                daalgavar:"Хүүхдэд өөрийн мэдрэмжийг бусадтай хуваалцах сорилт өгч, тухайн өдрийн турш яагаад түгшсэн, ямар мэдрэмж төрсөн талаар ярилцаж үзэх. Энэ нь түгшүүрийг бууруулахад ихээхэн үр дүнтэй байдаг.",
                example: [],
            },
            {
                name:"Сайн зүйлсийг эрэлхийлэх",
                daalgavar:"Хүүхдийг өдөр бүр сайн зүйлсийг тэмдэглэхийг уриалаарай.",
                example: [
                    "'Өнөөдөр миний хамгийн сайхан зүйл юу байсан вэ?' гэх мэт асуултаар сайн талуудыг харахад нь туслах."
                ],
            },
        ],
        t2: [
            {
                name:"Тайвшралын минут🧘‍♀️",
                daalgavar:"Өдөр бүр 5 минут ч гэсэн тайван орчинд өнгөрөөж, гүн амьсгал авч, биеэ амраах.",
                example: [
                    "Өдөр бүр аль нэг цагт (жишээ нь, өглөө, орой) тайван орчинд сууж, гүн амьсгал ав.",
                    "Энэхүү дасгал нь сэтгэл зүйн амар амгалан байдлыг бий болгоно.",
                ],
                zorilgo:"🎯 Тайван байх, сэтгэл санааг сэргээх, түгшүүрийг бууруулах."
            },
            {
                name:"Өдөр тутмын эерэг бодол📝",
                daalgavar:"Өдөр бүр 3 эерэг зүйлс тэмдэглэж бичих. Эдгээр нь энгийн зүйлс байж болно.",
                example: [
                    "Өнөөдөр би сайхан амралттай байсан,",
                    "Өнөөдөр би дуулсан хөгжимд дуртай байсан,",
                    "Өнөөдөр би найзтайгаа ярилцсан.",
                ],
                zorilgo:"🎯 Эерэг хандлага үүсгэх, өдөр тутмын амжилтуудыг тэмдэглэх."
            },
            {
                name:"Хурдан алхах🚶‍♀️",
                daalgavar:"Өдөр бүр 15 минутын хурдан алхалт хийх. Алхах нь сэтгэл санааг амраах, биеийн чалхыг нэмэгдүүлэх, сэтгэл зүйн хувьд тайвшрахад тусална.",
                example: [
                    "Аль болох тайван орчинд алхах, амьсгалын дасгал хийн, чөлөөтэй алхах.",
                ],
                zorilgo:"🎯 Сэтгэл санааг амраах, биеийг эрүүл байлгах."
            },
            {
                name:"Талархлын жагсаалт🌸",
                daalgavar:"Өдөр бүр 3 зүйлсийг талархаж бичих. Эдгээр нь амьдралд эерэг нөлөө үзүүлдэг зүйлс байж болно. ",
                example: [
                    "Өнөөдөр би сайн унтаж амарсан,",
                    "Өнөөдөр миний хичээл амжилттай дууссан,",
                    "Өнөөдөр миний гэр бүл миний хамт байсан.",
                ],
                zorilgo:"🎯 Эерэг бодол, талархал үүсгэх, сэтгэл зүйн хандлагыг дээшлүүлэх."
            },
            {
                name:"Сайн муу зүйлсийг ялгах🤔",
                daalgavar:"Өдөр бүр өөрийн сэтгэл зүйд нөлөөлж буй сайн ба муу зүйлсийг ялгаж бичих.",
                example: [
                    "Өнөөдөр миний хийсэн эерэг зүйлс: би өглөө эрт боссон, сайн суралцсан.",
                    "Өнөөдөр миний сэтгэлд түгшүүр төрүүлсэн зүйлс: сургуульд амжилтгүй болох тухай бодсон.",
                ],
                zorilgo:"🎯 Өдөр тутмын сэтгэл зүйн хүлээцтэй байдал, эерэг сэтгэл санаа үүсгэх."
            },
        ],
        t3: [
            {
                name:"Гүн амьсгал авах дасгал🌬️",
                daalgavar:"Өдөр бүр 5-10 минутын турш гүн амьсгал авах дасгал хийж, тайван байх.",
                example: [
                    "4 секунд амьсгалж, 4 секунд хүлээгээд, 4 секунд гадагшлуулж амьсгална.",
                    "Энэ дасгал нь сэтгэл зүйн стрессийг бууруулж, түгшүүрийг намдаахад тусална.",
                ],
                zorilgo:"🎯 Түгшүүрийг багасгах, тайвшрал олох."
            },
            {
                name:"Өдөр тутмын эерэг үйлдэл✨",
                daalgavar:"Өдөр бүр нэг жижиг эрч хүчтэй эерэг үйлдэл хийх.",
                example: [
                    "Өдөр тутмын үүрэгт ажилтай холбоотой амжилттай гүйцэтгэх зорилт тавих,",
                    "Өдөр тутмын бодол, үйлдлүүддээ эерэг хандлага оруулах,",
                    "Дуртай зүйлсээ хийх (дохиогоо сонсох, дасгал хийх, зураг зурах).",
                ],
                zorilgo:"🎯 Өдөр тутмын амжилт, сэтгэл зүйн эерэг хандлага олох."
            },
            {
                name:"Тамирчин байх🏃‍♂️",
                daalgavar:"Өдөр бүр 10-20 минутын турш биеийн хөдөлгөөнийг хийж, актив байх. Энэ нь стрессийг бууруулж, сэтгэл зүйг тэнцвэржүүлэхэд тусална.",
                example: [
                    "Хурдан алхах,",
                    "Гүйх эсвэл дугуй унах,",
                    "Йог хийх.",
                ],
                zorilgo:"🎯 Биеийн хөдөлгөөнөөр стрессийг бууруулах, амар амгалан байдлыг мэдрэх."
            },
            {
                name:"Талархлын жагсаалт🙏",
                daalgavar:"Өдөр бүр 3 талархал илэрхийлэх зүйлсийг бичих. Эдгээр зүйлс нь таны өдөр тутмын амьдралд эерэг нөлөө үзүүлдэг зүйлс байж болно.",
                example: [
                    "Өнөөдөр би амар тайван байсан,",
                    "Өнөөдөр би анхны бэрхшээлийг амжилттай давсан,",
                    "Өнөөдөр миний гэр бүл надад тусалсан.",
                ],
                zorilgo:"🎯 Өдөр тутмын эерэг сэтгэгдлүүдийг хадгалах, сэтгэл санааг дээшлүүлэх."
            },
            {
                name:"Тогтмол амрах цаг🛀",
                daalgavar:"Өдөр бүр тайвшрахын тулд 15 минутыг амралтанд зориулж, өөрийгөө эрч хүчтэй байлгах.",
                example: [
                    "Тайван орчинд унтаж амрах,",
                    "Дуртай хоббигоо хийх,",
                    "Дуу сонсох, эсвэл ямар нэгэн бүтээлч ажил хийх.",
                ],
                zorilgo:"🎯 Бие болон сэтгэл зүйгээ амраах, стрессийг бууруулах."
            },
        ],
        t4: [
            {
                name:"Хэтрүүлсэн бодлуудыг бичих ✍️",
                daalgavar:"Өдөр бүр түгшүүрт бодлууд гарч ирэхэд тэдгээрийг бичгээр илэрхийлэх. Хэрвээ түгшүүрийн бодлууд бий болж байвал, тэр бүх бодлуудыг бичиж тэмдэглэх.",
                example: [
                    "Би сургуулиа орхих эсвэл яахаа мэдэхгүй байна,",
                    "Би хүний дургүйцлийг хүргэж магадгүй.",
                ],
                zorilgo:"🎯 Түгшүүрийг ойлгох, сэтгэл санааны асуудалтай тэмцэх."
            },
            {
                name:"Гүн амьсгал авах болон тайвшрах🧘‍♂️",
                daalgavar:"Өдөр бүр гүн амьсгалын дасгал хийж, тайвшрахын тулд бие болон сэтгэлээ амраах.",
                example: [
                    "Гүн амьсгал авах (4 секунд амьсгалж, 4 секунд хүлээж, 4 секунд гадагшлуулж).",
                    "Тайван орчинд суух, тархи болон сэтгэлээ тайвшруулах.",
                ],
                zorilgo:"🎯 Түгшүүрийг багасгах, биеийн болон сэтгэл зүйн амар амгалан байдал олох."
            },
            {
                name:"Төгсгөлгүй амжилттай туулах🏅",
                daalgavar:"Өдөр бүр 1 жижиг зорилго тавьж, түүнийг амжилттай гүйцэтгэх.",
                example: [
                    "Бичиглэл эсвэл төлөвлөгөө гаргах,",
                    "Өдөр тутмын үүрэг гүйцэтгэх,",
                    "Дуртай хоббигоо хийж амрах.",
                ],
                zorilgo:"🎯 Тууштай байдал, сэтгэл санааны тогтвортой байдал."
            },
            {
                name:"Өдөр тутмын эерэг бодол🌟",
                daalgavar:"Өдөр бүр 3 эерэг зүйл бичиж тэмдэглэ.",
                example: [
                    "Өнөөдөр би зүгээр л тайван байсан!",
                    "Өнөөдөр би сайн хийхэд сэтгэл хангалуун байсан!",
                ],
                zorilgo:"🎯 Өдөр бүр эерэг хандлага олох, түгшүүрийг бууруулах."
            },
            {
                name:"Өдөр тутмын сэтгэл зүйн тусламж🧠",
                daalgavar:"Өдөр бүр өөрийн сэтгэл зүйн бэрхшээлийг бичгээр илэрхийлж, тэдгээрийг шийдэх арга замуудыг эрж олох.",
                example: [
                    "Би түгшиж байна, хэрхэн тайвшрах вэ?",
                    "Би яагаад санаа зовж байна, үүнийг хэрхэн даван туулах вэ?",
                ],
                zorilgo:"🎯 Сэтгэл санаагаа ойлгох, асуудлуудаас гарч ирэх шийдэл олох."
            },
        ],
        t5:[
            {
                name:"Өдөр тутмын 10 минутын тайвшрал🌿",
                daalgavar:" Өдөр бүр 10 минутыг бие болон сэтгэл зүйгээ амраах дасгалд зориул. Энэ нь гүн амьсгал, тайван орчинд суух, байгалийг ажиглах, эсвэл сонсголын эмчилгээ (аромотерапи) хийх байж болно.",
                example: [],
                zorilgo:"🎯  Стрессийг бууруулах, сэтгэл санааны тэнцвэрийг олох."
            },
            {
                name:"Өөрийн хүчтэй талууд💪",
                daalgavar:"Өдөр бүр өөрийн хамгийн том давууд, хүчтэй талууд-ыг бичиж гаргах.",
                example: [
                    "Тэр дуртай хоббигоо хурдан сурах,",
                    "Тогтвортой байдал, асуудал шийдэх чадвар гэх мэт.",
                ],
                zorilgo:"🎯 Өөрийгөө үнэлэх, өөрийн хүчийг мэдрэх."
            },
            {
                name:"Зорилгоо амжилттай гүйцэтгэх✅",
                daalgavar:"Өдөр бүр 1 том зорилго тавьж, өөртөө түүнийг хийж гүйцэтгэх хугацааг тогтоох.",
                example: [
                    "Өдөр тутмын үүрэгт ажил хийх,",
                    "Дуртай хоббигоо хийх,",
                    "Өөрийн доторх сэтгэл зүйн асуудалтай тэмцэх гэх мэт.",
                ],
                zorilgo:"🎯 Сэтгэл санааны тэнцвэрийг олох, өөртөө итгэх итгэлийг нэмэгдүүлэх."
            },
            {
                name:"Талархлын тэмдэглэл📖",
                daalgavar:"Өдөр бүр талархал илэрхийлэх 3 зүйлсийг тэмдэглэж бичих.",
                example: [
                    "Өнөөдөр тохиолдсон эерэг үйл явдал,",
                    "Гэр бүл, найз нөхөд, хамт олон,",
                    "Өөрийнхөө сэтгэл зүйн өсөлт гэх мэт.",
                ],
                zorilgo:"🎯 Өөдрөг бодол, сэтгэл санааг сайжруулах."
            },
            {
                name:"Түр зуурын асуудлуудыг шийдэх дасгал💭",
                daalgavar:"Сэтгэл санааны хүндрэл, түгшүүр, стресстэй холбоотой нэг асуудлыг өдөр бүр шийдэх. Энэ нь ямар ч жижиг зүйл байж болно.",
                example: [
                    "Ганцаардалтай тэмцэх,",
                    "Хамгийн их түгшүүртэй сэдвийг бичиж, өөрийн шийдлийг олох.",
                    "Өөрийн сэтгэл санааны бэрхшээлийг бууруулахыг оролдох.",
                ],
                zorilgo:"🎯 Сэтгэл санааны сөрөг хандлагуудыг эрсдэлгүйгээр даван туулах."
            },
        ]
    },
    {
        category: "Stress",
        t1:[
            {
                name:"Эерэг сэтгэлгээний өдрийн тэмдэглэл бичих 📓",
                daalgavar:"Хүүхдэд өдөр бүрийн эерэг мөчүүдийг тэмдэглэхийг уриалах. Тэд юу сайн хийснийг, ямар сайхан зүйл тохиолдсон, ямар шинэ зүйл сурсан талаар бичих.",
                example: [],
                zorilgo:"🎯 Энэ нь сэтгэл санааг тэнцвэртэй байлгаж, эерэг сэтгэлгээ бий болгоход тусална."
            },
            {
                name:"Амралттай цагийг зөв хуваарилах 🕒",
                daalgavar:"Өдөрт 10-15 минутын хугацаатай амралт авахыг зөвлөх. Амралт нь сэтгэл санааг тайвшруулж, стрессээс сэргийлнэ.",
                example: [],
                zorilgo:"🎯 Энэ нь зураг зурж, амьсгалын дасгал хийх эсвэл зүгээр л чимээгүйхэн суух боломжийг олгоно."
            },
            {
                name:"Биеийн хөдөлгөөнтэй байж, дасгал хийх 🏃‍♀️",
                daalgavar:"Хүүхдэд өдөрт 20 минут орчим биеийн хөдөлгөөн хийх, янз бүрийн дасгалуудыг хийх даалгавар өгнө.",
                example: [],
                zorilgo:"🎯 Ямар нэгэн спортоор хичээллэх, гүйлт хийх, эсвэл гэртээ бүжиглэх зэрэг нь стрессийг бууруулахад маш сайн."
            },
            {
                name:"Сайн нойр авч, амарч байх 💤",
                daalgavar:"Хүүхдэд өдөр бүр тогтсон цагт унтаж амрах, сайн нойр авахыг уриалах.",
                example: [],
                zorilgo:"🎯 Нойр нь сэтгэл санааг тэнцвэртэй байлгаж, биеийн эрч хүчийг сэргээхэд чухал үүрэгтэй."
            },
            {
                name:"Бусадтай сэтгэл хөдлөлөө хуваалцах 💬",
                daalgavar:"Хүүхдэд сэтгэл хөдлөлөө бусадтай хуваалцахыг уриалах. Бусдад ярих нь тэдний стрессийг бууруулахад тусална.",
                example: [],
                zorilgo:"🎯 Энэ нь найз нөхөд, гэр бүлийнхэнтэй ярилцах, эсвэл сэтгэл зүйчид хандах байдлаар илэрч болно."
            },
        ],
        t2: [
            {
                name:"Эерэг сэтгэлгээний хичээл (Positive Affirmations) 💪",
                daalgavar:"Хүүхдэд өдөр бүр 'Би чадна', 'Би хүчтэй', 'Би сайхан хүн' гэх мэт эерэг үгсийг өөртөө хэлэх даалгавар өгөх.",
                example: [],
                zorilgo:"🎯 Энэ нь өөртөө итгэх итгэлийг нэмэгдүүлж, стрессийг бууруулахад туслана."
            },
            {
                name:"Тоглоом эсвэл хобби хийх 🎨",
                daalgavar:"Хүүхдэд өдөр бүр 'Би чадна', 'Би хүчтэй', 'Би сайхан хүн' гэх мэт эерэг үгсийг өөртөө хэлэх даалгавар өгөх.",
                example: [],
                zorilgo:"🎯 Энэ нь стрессийг тайлж, сэтгэл санааг амраахад тусална."
            },
            {
                name:"Гүнзгий амьсгалын дасгал хийх 🌬️",
                daalgavar:"Хүүхдэд гүнзгий амьсгаа авах дасгал хийхийг санал болгох.",
                example: [],
                zorilgo:"🎯 Тэд 4 секунд амьсгаа авах, 4 секунд барих, 4 секунд гаргах дасгалаар стрессийг тайлах боломжтой."
            },
            {
                name:"Биеийн хөдөлгөөн хийх (Жишээ нь, гэртээ бүжиглэх) 💃",
                daalgavar:"Хүүхдэд 10-15 минутын хугацаанд бүжиглэх эсвэл өөрийн дуртай хөдөлгөөнөө хийхийг зөвлөх.",
                example: [],
                zorilgo:"🎯 Энэ нь стрессийг тайлж, биеийн эрч хүчийг сэргээхэд тусална."
            },
            {
                name:"Танилцуулах болон баярлах өдрийн тэмдэглэл 📖",
                daalgavar:"Хүүхдэд өдрийнхөө сэтгэл санаа, амжилт, сайхан мөчүүдийг тэмдэглэх даалгавар өгөх.",
                example: [],
                zorilgo:"🎯 Энэ нь сэтгэл санааг тэнцвэртэй байлгаж, стрессийг бууруулахад тусална."
            },
        ],
        t3:[
            {
                name:"Сэтгэл санааны тайвшруулалттай амьсгалын дасгал 🌬️",
                daalgavar:"Хүүхдэд гүнзгий амьсгаа авах дасгал хийхийг зөвлөх",
                example: [],
                zorilgo:"🎯 Жишээлбэл, 4 секунд амьсгаа авах, 4 секунд барих, 4 секунд гаргах эсвэл 'амьсгал авах, гаргах' гэж бодож хүлээх дасгал хийж стрессийг бууруулах."
            },
            {
                name:"Амралтын хугацааг тогтмол авах 🕒",
                daalgavar:"Хүүхдэд өдөрт 15-20 минутын хугацаатай амралт авах даалгавар өгөх.",
                example: [],
                zorilgo:"🎯 эд энэ хугацаанд ном унших, хөгжим сонсох, зургаа зурах гэх мэт амарч, стрессээ тайлж болох идэвхтэй зүйлс хийх боломжтой."
            },
            {
                name:"Өдөртөө 3 эерэг зүйл тэмдэглэх 📓",
                daalgavar:"Хүүхдэд өдөр бүрийнхээ эерэг зүйлсийг тэмдэглэх даалгавар өгөх.",
                example: [],
                zorilgo:"🎯 Жишээлбэл, 'Өнөөдөр юу сайхан болсон вэ?' эсвэл 'Юу намайг инээлгэсэн бэ?' гэх мэт асуултаар өөрийгөө өөдрөг сэтгэлээр харж, сэтгэл санааг дэмжих."
            },
            {
                name:" Биеийн хөдөлгөөнтэй байх 🏃‍♂️",
                daalgavar:"Хүүхдэд 20-30 минутын хугацаатай биеийн хөдөлгөөн хийхийг зөвлөх.",
                example: [],
                zorilgo:"🎯 Жишээ нь, гүйх, бөмбөг тоглох, гэртээ бүжиглэх, эсвэл хөдлөх ямар нэгэн идэвхтэй спорт хийх нь стрессийг бууруулахад үр дүнтэй."
            },
            {
                name:"Эмпатийг хөгжүүлэх дасгал (Бусдад анхаарал хандуулах) 💬",
                daalgavar:"Хүүхдэд бусдад туслах, анхаарал хандуулах даалгавар өгөх.",
                example: [],
                zorilgo:"🎯 Тэд гэр бүлийнхнээ, найзууддаа эерэг сэтгэлээр дэмжиж, тэдний мэдрэмжийг ойлгох дасгал хийж сэтгэл санаагаа тайвшруулж болно."
            },
        ],
        t4: [
            {
                name:"Сэтгэл санааны дэмжлэг авах (Сэтгэл зүйчид хандах) 🧠",
                daalgavar:"Хүүхдэд сэтгэл зүйчтэй уулзаж, сэтгэл санааны хямралыг даван туулахад туслах мэргэжлийн дэмжлэг авахыг зөвлөх.",
                example: [],
                zorilgo:"🎯 Тэд өөрийн мэдрэмжээ илэрхийлж, мэргэжлийн тусламж авахад илүү тайвшрах боломжтой."
            },
            {
                name:"Өдөр бүрийн амралтын цагийг төлөвлөх 🕒",
                daalgavar:"Хүүхдэд өдөр бүр 30 минутын амралтын цагийг хуваарилах.",
                example: [],
                zorilgo:"🎯 Тэд өөрийн мэдрэмжээ илэрхийлж, мэргэжлийн тусламж авахад илүү тайвшрах боломжтой."
            },
            {
                name:"Өдөр тутмын дасгал хийх (Биеийн болон сэтгэл санааны хөдөлгөөн) 🏃‍♀️",
                daalgavar:"Хүүхдэд биеийн хүчтэй хөдөлгөөн хийхийг зөвлөх.",
                example: [],
                zorilgo:"🎯 Жишээ нь, өдөрт 30 минутын хугацаанд гүйлт хийх, спортын төрлүүдийг хичээллэх, эсвэл бүжиглэх нь биеийн эрч хүчийг сэргээж, стрессийг бууруулахад туслах болно."
            },
            {
                name:"Өөрийгөө шагнах эсвэл амжилтаа тэмдэглэх 🌟",
                daalgavar:"Хүүхдэд өдөр бүр өөрийн жижиг амжилтыг тэмдэглэж, өөрийгөө шагнах даалгавар өгөх.",
                example: [],
                zorilgo:"🎯 Энэ нь сэтгэл санааг сэргээж, өөртөө итгэх итгэлийг нэмэгдүүлэхэд туслах бөгөөд стрессээс ангижрахад ч чухал үүрэгтэй."
            },
            {
                name:"Өдөр тутмын сэтгэл санааны хөнгөлөлттэй дасгал (Медитаци, амьсгалын дасгал) 🧘‍♂️",
                daalgavar:"Хүүхдэд медитаци эсвэл гүнзгий амьсгалын дасгал хийхийг зөвлөх.",
                example: [],
                zorilgo:"🎯 5-10 минутын хугацаанд сэтгэл санаагаа амраах, чимээгүй орчинд байх нь стрессийг бууруулахад ихээхэн тусалдаг."
            },
        ],
        t5: [
            {
                name:"Сэтгэл зүйчтэй, эмчтэй уулзах (Мэргэжлийн тусламж авах) 🧠",
                daalgavar:"Хүүхдэд сэтгэл зүйчтэй уулзах, тэдний сэтгэл санааг зөв зохицуулахад туслах.",
                example: [],
                zorilgo:"🎯 Энэ нь маш чухал бөгөөд стрессийн өндөр түвшинд байгаа хүүхдэд сэтгэл зүйн тусламж авах нь зөвхөн зөвлөгөө өгөх төдийгүй, сэтгэл санааны хямралыг даван туулах арга замыг хайхад чиглэнэ."
            },
            {
                name:"Тайван орчинд амар тайван байх (Медитаци эсвэл Йога) 🧘‍♂️",
                daalgavar:"Хүүхдэд өдөрт 10-15 минутын хугацаанд тайван орчинд, гүнзгий амьсгал авч, медитаци эсвэл йога хийх.",
                example: [],
                zorilgo:"🎯 Энэ нь стрессийг бууруулах, сэтгэл санааг амраахад үр дүнтэй бөгөөд хүүхэд гүн тайвшралтай болох боломжийг олгоно."
            },
            {
                name:"Эерэг сэтгэл зүйн өөрчлөлт хийх (Сайн сайхны дүр төрхийг бүтээх) 🌟",
                daalgavar:"Хүүхдэд сэтгэл санаагаа сайжруулах, эерэг хандлагатай байх талаар өөрийн сэтгэл зүйн дүр төрхийг өөрчлөх даалгавар өгөх.",
                example: [],
                zorilgo:"🎯 Жишээлбэл, сөрөг бодолтой байхгүй байх, бүх зүйлд эерэг хандах, жижиг амжилт бүрт баярлах, өөрийгөө хайрлах."
            },
            {
                name:"Нийгмийн дэмжлэг (Гэр бүлийнхэн болон найзуудтайгаа ярих) 💬",
                daalgavar:"Хүүхдэд сэтгэл санаагаа бусадтай хуваалцах, гэр бүлийнхэн эсвэл найзуудтайгаа өөрийн мэдрэмжийг илэрхийлэхийг уриалах.",
                example: [],
                zorilgo:"🎯 Нийгмийн дэмжлэг нь маш чухал бөгөөд энэ нь стрессийг бууруулахад чухал үүрэг гүйцэтгэнэ."
            },
            {
                name:"Сэтгэл санааны амралттай үйл ажиллагаа хийх (Тоглоом эсвэл урлагийн бүтээл) 🎨",
                daalgavar:"Хүүхдэд амрах, өөрийгөө илэрхийлэх зорилгоор зураг зурах, хөгжим тоглох эсвэл өөрийн дуртай хоббигоо хийх даалгавар өгөх.",
                example: [],
                zorilgo:"🎯 Бүтээлч үйл ажиллагаа нь сэтгэл санааг тайвшруулж, стрессийг бууруулж, сэтгэл зүйн дарамтыг намдаахад тусална."
            },

        ]
    },
    {
        category: "UII",
        t1: [
            {
                name:"Бага зэргийн зорилго тавих 🎯",
                daalgavar:"Хүүхэд жижиг амжилт олж, өөртөө итгэх итгэлээ нэмэгдүүлнэ.",
                example: [],
                zorilgo:"🎯 Хүүхдэд жижиг зорилго тавьж, амжилт гаргах замаар өөртөө итгэх итгэлийг нэмэгдүүлэх."
            },
            {
                name:"Алдаанаас суралцах дадал зуршил ❌➡️📚",
                daalgavar:"Хүүхэд алдаагаа хүлээн зөвшөөрч, түүнд суралцаж, итгэлтэй болно.",
                example: [],
                zorilgo:"🎯 Хүүхдэд алдаа гаргаснаа хүлээн зөвшөөрч, түүнийг суралцах боломж болгон ашиглах."
            },
            {
                name:"Өөртөө эерэг үг хэлэх дадал 💬✨",
                daalgavar:"Өдөр бүр эерэг үгс хэлэхэд хүүхэд өөртөө итгэх итгэлээ нэмэгдүүлнэ.",
                example: [],
                zorilgo:"🎯 Хүүхдэд өөрийнхөө чадвар болон давуу талуудыг таньж, өөртөө эерэг үгс хэлж сурах."
            },
            {
                name:"Тусламж авах боломжийг нээлттэй байлгах 🤝",
                daalgavar:"Хүүхэд тусламж хүсэхэд ичихгүй, бусдаас суралцаж, илүү итгэлтэй болдог.",
                example: [],
                zorilgo:"🎯 Хүүхдэд тусламж авах нь сул дорой байдал биш, харин өсөж, суралцах боломж гэдгийг ойлгуулах."
            },
            {
                name:"Өөрийнхөө амжилт, давуу талуудыг дүгнэх 🏆💪",
                daalgavar:"Хүүхэд өөрийн давуу талуудаа ойлгож, өөртөө итгэх итгэлээ бэхжүүлнэ.",
                example: [],
                zorilgo:"🎯 Хүүхдэд өөрийнхөө хийсэн амжилт, давуу талуудыг таньж, үүнийг хүлээн зөвшөөрч, өөртөө итгэх итгэл нэмэгдүүлэх."
            },
        ],
        t2: [
            {
                name:"Өдөр тутам жижиг зорилго тавих 🎯",
                daalgavar:"Хүүхдэд 'Өнөөдөр энэ даалгаврыг дуусгах' эсвэл '5 минутын хугацаанд уншиж сурах' гэх мэт жижиг зорилго тавьж, амжилт гаргахыг урамшуулах.",
                example: [],
                zorilgo:"🎯 Хүүхдэд өдөрт нэг жижиг зорилго тавьж, тэр зорилгоо биелүүлэх замаар өөртөө итгэх итгэлийг нэмэгдүүлэх."
            },
            {
                name:"Өдөр бүр өөртөө эерэг үг хэлэх 💬🌟",
                daalgavar:"Хүүхдийг өдөр бүр 'Би чадна!' эсвэл 'Би хүчтэй!' гэх мэт эерэг үгсийг хэлэхийг урамшуулж, өдөр тутмын дасгал болгох.",
                example: [],
                zorilgo:"🎯 Хүүхдэд өөртөө эерэг үг хэлэхийг дадал болгох, энэ нь тэдний сэтгэл зүйн байдлыг сайжруулахад туслах."
            },
            {
                name:" Алдаа гаргасан ч сэтгэлээр унахгүй байх ❌➡️💪",
                daalgavar:"Хүүхдэд 'Алдаа гаргасан ч чамд бүх зүйл сайн байна, дараагийн удаа илүү сайн хийнэ' гэж хэлж, амжилттай суралцахад нь туслах.",
                example: [],
                zorilgo:"🎯 Хүүхдэд алдааг хүлээн зөвшөөрч, түүнд сэтгэлээр унахгүй байх, харин алдаагаа засахыг урамшуулах."
            },
            {
                name:"Тусламж хүсэхэд ичихгүй байх 🤝",
                daalgavar:"Хүүхдийг 'Хэрэв чи ямар нэг зүйл ойлгохгүй байгаа бол асуу, тусламж авах нь зөв' гэж хэлж, тусламж хүсэхийг дэмжих.",
                example: [],
                zorilgo:"🎯 Хүүхдэд тусламж хүсэхэд ичихгүй, харин тусламж авах нь өсч хөгжих боломж гэж ойлгуулах."
            },
            {
                name:"Өөрийн давуу талуудыг таньж, бахархах 🏆💡",
                daalgavar:"Хүүхдэд 'Чи ямар зүйлд сайн вэ?' гэж асууж, түүний давуу талуудыг тодорхойлж, өөрийн чадварыг үнэлэхийг дэмжих.",
                example: [],
                zorilgo:"🎯 Хүүхдэд өөрийнхөө давуу талуудыг таньж, үүндээ бахархах боломжийг олгох."
            },
        ],
        t3: [
            {
                name:"Өөрийнхөө зорилгоо тодорхойлох 🎯",
                daalgavar:"Хүүхдийг 'Хэрэв чи ямар нэг зүйл ойлгохгүй байгаа бол асуу, тусламж авах нь зөв' гэж хэлж, тусламж хүсэхийг дэмжих.",
                example: [],
                zorilgo:"🎯 Хүүхдэд өөрийнхөө зорилго, хүсэл мөрөөдлийг тодорхойлох чадварыг эзэмшүүлэх."
            },
            {
                name:"Өөрийн шийдвэрийг гаргах 🧠",
                daalgavar:"Хүүхдэд өдөр тутмын жижиг шийдвэрүүдийг өөртөө гаргуулж сурах.",
                example: [
                    "'Өнөөдөр юу идэх вэ?' эсвэл 'Юу өмсөх вэ?' гэх мэт. Эцэг эх нь хүүхдийг шийдвэр гаргахдаа дэмжиж, урамшуулна."
                ],
                zorilgo:"🎯 Хүүхдэд өөрийн шийдвэрийг гаргах боломжийг олгох, түүнд итгэх итгэлийг бэхжүүлэх."
            },
            {
                name:"Өөрийн амжилтаа үнэлэх 🏅",
                daalgavar:"Хүүхдийг өөрийн амжилт, хүрсэн үр дүнгүүдийг харж, түүгээрээ бахархахыг урамшуулах.",
                example: [
                    "'Чи одоо хүртэл их зүйл амжилттай хийлээ, сайн байна!' гэж хэлж, түүний амжилт бүрийг үнэлэх."
                ],
                zorilgo:"🎯 Хүүхдэд өөрийн амжилтаа таньж, түүнийгээ үнэлэх чадварыг олгох."
            },
            {
                name:"Өөрийн алдааг хүлээн зөвшөөрч, дахин оролдох ❌➡️🔄",
                daalgavar:"Хүүхдийг алдааг хүлээн зөвшөөрч, үүнээс суралцах хэрэгтэй гэдгийг ойлгуулах.",
                example: [
                    "'Тэр алдаа чинь сайжруулах боломж байна, дараагийн удаа илүү сайн хийх боломжтой.' гэж хэлж, алдааг даван туулахад нь туслах."
                ],
                zorilgo:"🎯 Хүүхдэд алдаа гаргаснаа хүлээн зөвшөөрч, үүнийг давах эрмэлзэлтэй болох."
            },
            {
                name:"Өөрийн санаа бодлоо илэрхийлэх 💬",
                daalgavar:"Хүүхдийг ямар ч нөхцөлд өөрийн үзэл бодол, сэтгэл хөдлөлийг илэрхийлэхийг дэмжих.",
                example: [
                    "'Чамд ямар саналаа хэлэх хүсэл байна?' эсвэл 'Чи энэ талаар юу бодож байна вэ?' гэж асууж, хүүхдийг хэлэхийг урамшуулах."
                ],
                zorilgo:"🎯 Хүүхдэд өөрийн санаа, үзэл бодлоо илэрхийлэх, өөрийнхөө үгийг сонсох эрхтэй гэдгийг ойлгуулах."
            },
        ],
        t4: [
            {
                name:"Томоохон зорилго тавих 🎯🚀",
                daalgavar:"Хүүхдийг томоохон зорилго тавихыг урамшуулж, түүнийхээ жижиг алхмуудыг хэрхэн төлөвлөхөө заах.",
                example: [
                    "Ирээдүйд хүсэж байгаа зүйлийнхээ талаар бодоод, энэ зорилгодоо хэрхэн хүрэхийг төлөвлөж үзье"
                ],
                zorilgo:"🎯 Хүүхдэд томоохон зорилго тавихад нь туслах, түүнийгээ зорилго болон алхам болгож төлөвлөх."
            },
            {
                name:"Чадвараа өргөжүүлэх зорилго тавих 💪📚",
                daalgavar:"Хүүхдэд өөрийнхөө хамгийн дуртай зүйлсийг амжилттай хийхэд шаардлагатай чадваруудыг сурахыг дэмжих.",
                example: [
                    "Өөрийнхөө чадварыг байнга сайжруулж байх нь чамд илүү их амжилт авчирна."
                ],
                zorilgo:"🎯 Хүүхдэд өөрийн чадвараа байнга хөгжүүлэх эрмэлзэлтэй байхын ач холбогдлыг ойлгуулах."
            },
            {
                name:"Амжилтаа хүлээн зөвшөөрөх 🏆✨",
                daalgavar:"Хүүхдийг өөрийн амжилтыг бахархан, баяртайгаар хүлээн зөвшөөрч, түүнийхээ үр дүнг үнэлэхийг дэмжих.",
                example: [
                    "Чи энэ амжилтыг гаргасан нь үнэхээр гайхалтай, өөртөө бахархах ёстой."
                ],
                zorilgo:"🎯 Хүүхдэд өөрийн амжилтыг хүлээн зөвшөөрч, түүнийгээ үнэлэх чадварыг олгох.."
            },
            {
                name:"Сурсан зүйлсийг бусдад заах 👩‍🏫👨‍🏫",
                daalgavar:"Хүүхдийг өөрийнхөө мэдсэн зүйлийг бусдад зааж, тэдэнд туслахыг дэмжих.",
                example: [
                    "Чи энэ зүйлсийг сайн мэддэг, бусдад зааж өгөхөд хэцүү биш."
                ],
                zorilgo:"🎯 Хүүхдэд сурсан зүйлсийг бусдад заах боломж олгох, энэ нь тэдний өөртөө итгэх итгэлийг нэмэгдүүлэх."
            },
            {
                name:"Шинэ сорилтод тулалдах 💥🎯",
                daalgavar:"Хүүхдийг шинэ зүйлсийг туршиж үзэхэд урамшуулах.",
                example: [
                    "Энэ шинэ сорилт чамд таалагдахгүй байж болох ч, үүнийг даван туулснаар чи өөртөө итгэх итгэлтэй болно."
                ],
                zorilgo:"🎯 Хүүхдэд шинэ сорилтод илүү зоригтой, сэтгэлээр өндөр оролцохыг дэмжих."
            },
        ],
    },
    
]

let user = [
    {
        userName: "Bayraa",
        school: "DMTS",
        class: 11,
        buleg: "b",
        phone:9911,
        role:'student',
        email:"bat@gmail.com",
        challenge: [
            {
                challenge: "setgel gutral",
                point:0,
                t1:1,
                t2:0,
                t3:1,
                t4:0,
            },
            {
                challenge: "setgel gutral",
                point:0,
                t1:1,
                t2:0,
                t3:1,
                t4:0,
            },
            {
                challenge: "setgel gutral",
                point:0,
                t1:1,
                t2:0,
                t3:1,
                t4:0,
            },
            {
                challenge: "setgel gutral",
                point:0,
                t1:1,
                t2:0,
                t3:1,
                t4:0,
            }



        ]
    }
]

let turshilt