const test = [
    {
        testName: "Setgel gutral",
        question: [
            "Би ерөнхийдөө амьдралаас эерэг мэдрэмж авч чаддаггүй юм шиг санагддаг.",
            "Би аливаа зүйлсэд санаачлагагүй хандаж, ямар нэгэн зүйл хийх сонирхолгүй болсон.",
            "Надад хүсэл тэмүүлэл юу ч байхгүй болсон мэт мэдрэгдэж байсан.",
            "Надад гунигтай, сэтгэлээр унасан мэдрэмжүүд төрж байсан.",
            "Би ямар нэгэн зүйлээс урам зориг авахаа больсон.",
            "Би тийм ч үнэ цэнтэй хүн биш юм шиг санагдах болсон.",
            "Амьдрал утгагүй мэт санагдаж байсан."
        ],
        result: [
            {
                result:"Надад тохиолдоогүй",
                score:0
            },
            {
                result:"Надад заримдаа тохиолдсон",
                score:1
            },
            {
                result:"Надад тодорхой хугацаанд тохиолдож байсан",
                score:2
            },
            {
                result:"Надад маш олон тохиолдсон",
                score:3
            }
        ],
    },
    {
        testName: "Stress",
        question: [
            "Сүүлийн үед надад амьсгал аваад гаргахад хүндрэлтэй санагддаг болсон.",
            "Миний аливаа нөхцөл байдалд үзүүлж байгаа хариу үйлдэл маань хэтэрхий их болсон.",
            "Би аливаа зүйлийг маш их энерги зарцуулж хийдэг.",
            "Нэлээд амархан цухалдаж уурладаг болсон.",
            "Хааяа тайвшрахад хэцүү байдаг.",
            "Би ямар нэгэн зүйл хийж байхад саад болсон зүйлд тэвчилгүй уцаарлах байсан.",
            "Би түргэн ууртай болсон."
        ],
        result: [
            {
                result:"Надад тохиолдоогүй",
                score:0
            },
            {
                result:"Надад заримдаа тохиолдсон",
                score:1
            },
            {
                result:"Надад тодорхой хугацаанд тохиолдож байсан",
                score:2
            },
            {
                result:"Надад маш олон тохиолдсон",
                score:3
            }
        ],
    },
    {
        testName: "UII",
        question: [
            "Миний гадаад төрх надад таалагддаг",
            "Би аливаа зүйлийг хийхээсээ өмнө сайн боддог",
            "Би үе тэнгийнхний дарамт шахалтыг ихэвчлэн эсэргүйцдэг",
            "Би өөртөө итгэлтэй байдаг",
            "Би бусад хүмүүст таалагдахын тулд хуурамч дүр хэзээ ч эсгэдэггүй",
            "Би зөв зүйлийг л хийхийг хичээдэг",
            "Би шийдвэр гаргаад түүнийгээ тууштай баримталж чаддаг",
            "Би тийм ч амар бууж өгдөггүй",
            "Би зөв гэж бодсон зүйлээ хамгаалан босдог",
            "Биеийнхээ гадаад үзэмжээрээ би бахархдаг",
            "Би өөрөө өөртөө таалагддаг",
            "Бусадтай хэл амаа ололцоход надад хялбар байдаг",
            "Эсрэг хүйсний хүмүүстэй найз нөхөд болоход надад хүндрэл гардаггүй"
        ],
        result: [
            {
               result: "Санал бүрэн нийлж байна",
               score: 5
            },
            {
                result: "Санал ерөнхийдөө нийлж байна",
                score:4
            },
            {
                result:"Эргэлзэж байна",
                score:3
            },
            {
                result:"Санал ерөнхийдөө нийлэхгүй байна",
                result:2
            },
            {
                result:"Санал огт нийлэхгүй байна",
                score:1
            }
        ],
    },
    {
        testName: "Tugshuur",
        question: [
            "Ам хатдаг болсон.",
            "Амьсгалахад хүндрэлтэй байх болсон (Ялангуяа хэт их амьсгалах, биеийн ачаалал аваагүй байхад амьсгаадах)",
            "Үе үе гар чичрэх тохиолдлууд надад гарсан.",
            "Би хэтэрхий их сандарснаасаа болоод өөрийгөө эвгүй байдалд оруулах үйлдэл хийж байсан.",
            "Заримдаа юунаас болсноо мэдэхгүй ч сандрах мэдрэмж төрөөд байдаг.",
            "Биеийн хүчтэй ачаалал аваагүй байхад зүрх дэлсэхийг мэдэрч байсан.",
            "Ямар нэгэн тодорхой шалтгаангүйгээр айдсыг мэдэрч байсан."
        ],
        result: [
            {
                result:"Надад тохиолдоогүй",
                score:0
            },
            {
                result:"Надад заримдаа тохиолдсон",
                score:1
            },
            {
                result:"Надад тодорхой хугацаанд тохиолдож байсан",
                score:2
            },
            {
                result:"Надад маш олон тохиолдсон",
                score:3
            }
        ],
    },
    
]

const challenge = [
    {
        category: "Setgel gutral",
        t1: [
            {
                name:"Инээмсэглэлийн цуглуулга 📸",
                daalgavar:"Өдөр бүр инээмсэглэж буй нэг зураг дарах эсвэл өөрийг нь инээлгэсэн үйл явдлыг тэмдэглэх.",
                example: [],
                zorilgo:"🎯 Өөрийгөө аз жаргалтай мөчүүд дээр төвлөрөхөд сургах"
            },
            {
                name:"Хачирхалтай даалгавар🤹‍♂️",
                daalgavar:"Өдөр бүр ердийн бус, хөгжилтэй даалгавар гүйцэтгэх.",
                example: [
                    "Зүүн гараараа зураг зурах.",
                    "Нүдээ аниад нэрсэн ус, ундаа амталж ялгах.",
                    "Хөгжилтэй бүжиг хийх, эсвэл нэг өдөр ганцхан өнгийн хувцас өмсөх."
                ],
                zorilgo:"🎯 Өдөр тутмын хэв маягийг эвдэж бүтээлч сэтгэлгээг хөгжүүлэх."
            },
            {
                name:"Эерэг үгсийн ангууч 🔍",
                daalgavar:"Өдөр бүр ном, кино, эсвэл хүмүүсийн ярианаас 3 эерэг үг олж тэмдэглэх.",
                example: [],
                zorilgo:"🎯 айн сайхан зүйлийг олж харах, анзаарах дадал суулгах."
            },
            {
                name:"Надад ямар супер чадвар байна вэ? 🦸‍♀️",
                daalgavar:"Өөрийнхөө давуу тал, онцлог чадвараа олж тодорхойлох. Хэрэв санаанд орж ирэхгүй бол найз, гэр бүлийнхэнтэйгээ ярилцаж туслалцаа авах.",
                example: [],
                zorilgo:"🎯 Өөртөө итгэх итгэлийг нэмэгдүүлэх, өөрийгөө зөвөөр үнэлэх."
            },
            {
                name:"Хөгжилтэй даалгаврын гинжин холбоо🔗",
                daalgavar:"Найзуудтайгаа хамт гинжин хэлбэрийн тоглоом зохиох.",
                example: [
                    "Нэг нь 'Өнөөдөр би нэг хөгжилтэй үйлдэл хийх болно' гэж хэлнэ.",
                    "Дараагийнх нь 'Би хэн нэгнийг инээлгэх хөгжилтэй үг хэлнэ' гэх мэт үргэлжлүүлнэ."
                ],
                zorilgo:"🎯 Багийн уур амьсгал сайжруулах, хөгжилтэй байдал бий болгох."
            }
        ],
        t2: [
            {
                name:"Сэтгэл санааны өнгө🎨",
                daalgavar:"Өдөр бүр өөрийн сэтгэл санааг өнгөөр илэрхийлэх.",
                example: [
                    "Хэрвээ шар сонговол – аз жаргалтай,",
                    "цэнхэр бол – тайван,",
                    "саарал бол – гунигтай гэх мэт.",
                ],
                zorilgo:"🎯 Өдөр тутмын сонирхолтой байдлыг нэмэгдүүлэх, урам зоригтой байх."
            },
            {
                name:"Баярлуулах нууц даалгавар🎁",
                daalgavar:"Хэн нэгнийг баярлуулах нууц даалгавар гүйцэтгэх.",
                example: [
                    "Гэр бүлийн хүнд туслах,",
                    "Найздаа сайхан үг хэлэх,",
                    " Хэн нэгэнд гэнэтийн жижиг бэлэг өгөх байж болно."
                ],
                zorilgo:"🎯 Эерэг харилцааг дэмжих, бусдад туслах нь өөрийгөө илүү сайхан мэдрэхэд тусалдаг."
            },
            {
                name:"Ямар нэг шинэ зүйл туршъя!🚀",
                daalgavar:"Өдөр бүр өөртөө шинэ туршлага бий болгох.",
                example: [
                    "Шинэ амттай хоол идэх,",
                    "Өөр төрлийн хөгжим сонсох,",
                    "Гэртээ өөр газар унтах гэх мэт."
                ],
                zorilgo:"🎯 Өдөр тутмын сонирхолтой байдлыг нэмэгдүүлэх, урам зоригтой байх."
            },
            {
                name:"Талархлын 3 минут⏳",
                daalgavar:"Өдөр бүр 3 минут зарцуулж, аз жаргалтай эсвэл талархаж буй 3 зүйлээ бодож, тэмдэглэх",
                example: [],
                zorilgo:"🎯 Өөдрөг хандлага төлөвшүүлэх, анхаарлаа эерэг зүйлд төвлөрүүлэх."
            },
            {
                name:"Аз жаргалын жагсаалт📝",
                daalgavar:"Өөрийг нь аз жаргалтай болгодог 10 зүйл-ийн жагсаалт гаргах. Дараа нь эдгээрийн нэгийг өдөр бүр хийхийг оролдох.",
                example: [
                    "✅ Сонирхолтой ном унших",
                    "✅ Дуртай дуугаа сонсох",
                    "✅ Найзтайгаа ярилцах"
                ],
                zorilgo:"🎯 Өөрийгөө аз жаргалтай байлгах үйлдлүүдийг ухамсарлах."
            },
        ],
        t3: [
            {
                name:"Өдөр тутмын эерэг үгс🗣️",
                daalgavar:"Өдөр бүр өөртөө 3 эерэг зүйл хэлэх.",
                example: [
                    "Би чадна!",
                    "Өнөөдөр би сайхан хүн байж чадна!",
                    "Миний хийх зүйл амжилттай болно!",
                    "Эсвэл хүссэн үгсээ тэмдэглэж, өдөр бүр уншиж бай."
                ],
                zorilgo:"🎯 Өөртөө итгэх итгэлийг нэмэгдүүлэх, сэтгэл санааг дэмжих."
            },
            {
                name:"Сэтгэл санааны өвчин намдаах 5 минут🧘‍♀️",
                daalgavar:"Өдөр бүр 5 минутыг тайвшрахад зориулж, биеэ болон сэтгэлээ амраах.",
                example: [
                    "Гүн амьсгал авах,",
                    "Сэдэвчилсэн медитаци хийх,",
                    "Тайван, зөөлөн хөгжим сонсох."
                ],
                zorilgo:"🎯 Стрессийг бууруулах, сэтгэл санааг тогтворжуулах."
            },
            {
                name:"Тууштай байхын чэллэнж💪",
                daalgavar:"Өдөр бүр өөртөө нэг жижиг зорилт тавьж, үүнийг тууштай гүйцэтгэх.",
                example: [
                    "Хоол хийх,",
                    "Өдөр тутмын үүргээ биелүүлэх,",
                    "Шинэ ном унших. Эдгээр зорилго нь өдөр тутамд биелэгдэх боломжтой байх ёстой."
                ],
                zorilgo:"🎯 Тууштай байдал, амжилттай хандлагыг хөгжүүлэх."
            },
            {
                name:"Өдөр бүр нэг баяртай мөч✨",
                daalgavar:"Өдөр бүр нэг зүйл хийж, тэр мөчийг баяртайгаар тэмдэглэх.",
                example: [
                    "Хүүхэлдэйн кино үзэх,",
                    "Дуртай хүнтэйгээ ярих,",
                    "Багцлан бичих,",
                    "Зураг авах. Өдөр бүрийн жижиг баяр нь сэтгэл санааг сайжруулахад тусална."
                ],
                zorilgo:"🎯 Эерэг өдрийг бүрдүүлэх, сэтгэл санааг сайжруулах."
            },
            
            "'Өөртөө талархал илэрхийлэх🙏' 📌 Даалгавар: Өдөр бүр өөртөө талархал илэрхийлэх, өөрийн хийгээд өнгөрүүлсэн сайхан зүйлсээ бичиж тэмдэглэх. Жишээ нь: “Би энэ өдрийнхаа туршид сайхан үйлдэл хийсэн, би өөртөө талархаж байна.” “Өнөөдөр би ажлаа амжилттай дуусгалаа, би бахархаж байна!” 🎯 Зорилго: Өөрийгөө үнэлэх, талархал мэдрэх." 
        ],
        t4: [
            "","","","",""
        ]
    },
    {
        category: "UII",
        t1: [
            "","","","",""
        ],
        t2: [
            "","","","",""
        ],
        t3: [
            "","","","",""
        ],
        t4: [
            "","","","",""
        ]
    },
    
]

let user = [
    {
        userName: "Bayraa",
        school: "DMTS",
        class: 11,
        buleg: "b",
        phone:9911,
        email:"bat@gmail.com",
        challenge: [
            {
                challenge: "setgel gutral",
                point:0,
                t1:1,
                t2:0,
                t3:1,
                t4:0,
            },
            {
                challenge: "setgel gutral",
                point:0,
                t1:1,
                t2:0,
                t3:1,
                t4:0,
            },
            {
                challenge: "setgel gutral",
                point:0,
                t1:1,
                t2:0,
                t3:1,
                t4:0,
            },
            {
                challenge: "setgel gutral",
                point:0,
                t1:1,
                t2:0,
                t3:1,
                t4:0,
            }



        ]
    }
]

let turshilt